import 'dart:convert';
import 'dart:io';

class AnimalApi {

  List<Map<String, dynamic>> animals = [
    {
      "id": 1,
      "name": "Koala",
      "scientificName": "Phascolarctos cinereus",
      "description": "ชื่อวิทยาศาสตร์ Phascolarctos cinereus สัตว์ในตระกูลโคอาลา มีลำตัวอ้วนขนยุ่งหนาไม่มีหาง โคอาล่าตัวเต็มวัยมีความยาวประมาณ 70-80 ซม. น้ำหนักประมาณ 10 กก. ลำตัวมีสีเทาอ่อนถึงเหลืองอ่อน สีบริเวณท้องค่อนข้างสว่าง จมูกโล่ง หัวโตและกลมหัวกลม ขนที่ใบหูนุ่มมาก ปลายขามีกรงเล็บที่แข็งแรงมากและปีนป่ายได้ดี",
      "location": "ออสเตรเลีย นิวเซาท์เวลส์ ควีนส์แลนด์ในประเทศออสเตรเลียใต้",
      "behavior": "เกือบทงชวตอยบนตนยูคาลิปตัส เวลาส่วนใหญ่ใช้ไปกับการนอนและน้อยกว่า 10% ของเวลาที่มันใช้ไปกับการหาอาหาร เมื่อพวกมันลงจากต้นไม้พวกมันจะถอยหลงเสมอกันของพวกมนจะสัมผัสพื้นก่อนและการเคลื่อนไหวของพวกมันจะช้ามากโคอาล่าปรับตัวให้เข้ากับชีวิตตามธรรมชาติมากมายและแทบไม่เคยดื่มน้ำเลยพวกมันกินใบยูคาลิปตัสได้ทุกวัน่",
      "imagePath": "assets/coala.jpg"
    },
    {
      "id": 2,
      "name": "Giraffe",
      "scientificName": "Giraffa camelopardalis",
      "description": "สกุลหนึ่งของสัตว์เลี้ยงลูกด้วยนมในวงศ์ Giraffidae เป็นสัตว์เคี้ยวเอื้อง มีลักษณะเด่น คือ เป็นสัตว์ที่ตัวสูง ขายาว ล าคอยาว มีเขา 1 คู่ ตัวมีสีเหลืองและสีน้ำตาลเข้มเป็นลาย ตัวผู้มีความสูง 4.8 ถึง 5.5 เมตร และมีน ้าหนักถึง 200 กิโลกรัม ตัวเมียมีขนาดและความสูงน้อยกว่าเล็กน้อย ตัวผู้มีส่วนสูงประมาณ 18 ฟุต(5.48 เมตร) น ้าหนักประมาณ 1,100 - 1,932 กิโลกรัม ตัวเมียมีส่วนสูงประมาณ 17 ฟุต น ้าหนักประมาณ 700 -1,182 กิโลกรั ม",
      "location": "ทวีปแอฟริกา",
      "behavior": "อาศัยอยู่ในทุ่งกว้างรวมกันเป็นฝูง และหากินร่วมกับสัตว์อื่นพวกม้าลาย นกกระจอกเทศ และพวกแอนติโลป โดยยีราฟจะคอยระวังภัยให้ ตัวผู้มีการต่อสู้กันในช่วงฤดูผสมพันธุ์ ศัตรูสำคัญของยีราฟคือเสือดาวและสิงโต ซึ่งยีราฟป้องกันตัวโดยใช้หัวเหวี่ยงและใช้เท้าเตะ โดยปกติยีราฟจะมีอายุเฉลี่ยประมาณ 20-30 ปี",
      "imagePath": "assets/Giraffe.jpg"
    },
    {
      "id": 3,
      "name": "Hippopotamus",
      "scientificName": "Hippopotamus amphibius",
      "description": "ัตว์ที่มีรปร่างกลมใหญ่ และมีปากกว้างมากเขี้ยวล่างยาวโค้งเป็นอาวุธส าคัญประจ าตัว สังกตเห็นเส้นขนได้บริเวณรอบปากและใกล้กับปลายหาง หนังหนามีต่อมเมือก ต่อมใต้ผิวหนังจะผลิตเมือกเหลวออกมา มีประโยชน์เพื่อป้องกันอันตรายจากแสงแดดและป้องกันการติดเชื้อ",
      "location": "ทวีปแอฟริกา ทางด้านตะวันตก ตะวันออก และทางใต้ ของทวีป",
      "behavior": "อยู่รวมกันเป็นฝูง ปกติอาศัยอยู่ในน้ำตามบริเวณน้ำนิ่งหรือน้ำไหลเอื่อย ๆ ในช่วงเวลากลางวัน และขึ้นบกมาหากินตอนกลางคืน ปกติไม่ดุแต่ในช่วงผสมพันธุ์ตัวผู้จะต่อสู้กันอย่างดุร้าย จะดุเวลาตกใจหรือได้รับบาดเจ็บ และแม่ลูกอ่อนจะดุมาก ดำน้ำเก่ง สามารถเดินท่องอยู่ใต้น้ำได้",
      "imagePath": "assets/hippopotamus.jpg"
    },
    {
      "id": 4,
      "name": "Ostrich",
      "scientificName": "Struthio camelus",
      "description": "มีปีกเล็กบินไม่ได้แต่ขาใหญ่แข็งแรง มีนิ้วเท้าข้างละ 2 นิ้ววิ่งเร็วได้ถึง 64 กิโลเมตรต่อชั่วโมง ตัวผู้ขนทั่วตัวสีดำแต่ขนพวงปลายปีกหางเป็นสีขาว ตัวเมียขนสีน้ำตาลคล้ำ",
      "location": "ประเทศแอลจีเรีย แองโกลา บอตสวานา บูร์กินาฟาโซ แคเมอรูน สาธารณรัฐอัฟริกากลาง ชาด จิบูตี อียิปต์ เอริเทรีย เอธิโอเปีย เคนยา มาลีมอริเตเนีย โมซัมบิก นามิเบีย ไนเจอร์ ไนจีเรีย เซเนกัล แอฟริกาใต้ ซูดานใต้ ซูดาน แทนซาเนีย ยูกันดา แซมเบีย และซิมบับเว บริเวณที่เป็นทุ่งหญ้าสะวันนา",
      "behavior": "หากินในทุ่งกว้างรวมกันเป็นกลุ่ม อยู่ร่วมกับฝูงม้าลายและยีราฟ เพื่อคอยดักกินแมลงและสัตว์เลื้อยคลานเล็ก ๆ ที่ตื่นตกใจจากการกินหญ้าของสัตวเหล่านั้น ป้องกันตัวโดยใช้เท้าเตะเป็นนกที่มีการระแวดระวังภัยมาก ทำให้หลบหลีกพวกสัตว์กินเนื้อได้ดี",
      "imagePath": "assets/ostrich.jpg"
    },
    {
      "id": 5,
      "name": "Galápagos Giant Tortoise",
      "scientificName": "Chelonoidis nigra",
      "description": "่ชื่อทางวิทยาศาสตร์ Chelonoidis nigra โตเต็มที่มีขนาดใหญ่ที่สุดประมาณ 36 นิ้ว (3ฟุต) โดยตัวผู้จะมีขนาดใหญ่กว่าตัวเมีย น้ำหนักมากกว่า 100 กิโลกรัม เป็นเต่าที่มีขนาดใหญ่ที่สุดเป็นอันดับ 3 ของโลก มีอายุยืนได้นานมากกว่า 100 ปี หรือเกือบ ๆ 200 ปี เต่ายักษ์แห่งหมู่เกาะกาลาปากอสมีบทบาทสำคัญในการสร้างทฤษฎีวิวัฒนาการของชาร์ลส์ ดาร์วิน ความผันแปรที่สังเกตได้จากประชากรเต่าบนเกาะต่างๆ มีความสำคัญต่อความเข้าใจของดาร์วินเกี่ยวกับการคัดเลือกโดยธรรมชาติ",
      "location": "หมู่เกาะกาลาปาโกสกลางมหาสมุทรแปซิฟิ กตอนใต้ ในเขตของประเทศเอกวาดอร์ เท่านั้น",
      "behavior": "เเต่ายักษ์เป็นสัตว์กินพืช กินหญ้า ใบไม้ ต้นกระบองเพชร และพืชผักอื่นๆเป็นหลัก พวกมันปรับตัวเข้ากับอาหารได้ดีและสามารถอยู่รอดได้เป็นเวลานานโดยไม่มีอาหารหรือน้ำ โดยเก็บน้ำไว้ในร่างกายและไขมันสำรองไว้ในกระดอง",
      "imagePath": "assets/GalápagosGiantTortoise.jpg"
    },
    {
      "id": 6,
      "name": "Asian Elephant",
      "scientificName": "Elephas maximus",
      "description": "ชื่อทางวิทยาศาสตร์Elephas maximus อวัยวะพิเศษสองอย่าง นั่นคืองวงเป็นจมูกและริมฝีปากบนที่ยื่นยาวออกมา ส่วนงาเป็นเขี้ยวใช้เป็นอาวุธและงัดยกสิ่งของ ช้างเพศผ้มีงาเรียกว่า ช้างพลาย แต่บางตัวไม่มีงาเรียก ช้างสีดอ เพศเมียปกติไม่มีงาเรียก ช้างพัง แต่บางตัวอาจมีงาสั้น ๆ เรียกงาสั้นๆนี้ว่า ขนาย หนังบริเวณกลางตัวหนาราว 1.9-3.2 เซนติเมตร เป็นสัตว์กระเพาะเดียว มีฟัน 26 ซี่",
      "location": "กระจายพันธุ์ในกลุ่มประเทศเอเชียใต้ และกลุ่มประเทศเอเชียตะวันออกเฉียงใต้",
      "behavior": "สัตว์สังคมฝูงช้างซึ่งเรียกว่า โขลง ประกอบด้วยตัวเมียที่เป็นญาติพี่น้องกันและช้างเด็ก โขลงมีช้างตัวเมียที่อาวุโสที่สุดซึ่งเรียกว่า แม่แปรก เป็นจ่าโขลง แต่ละโขลงมีสมาชิกประมาณ 6-7 ตัว ส่วนใหญ่ช้างออกหากินในเวลากลางคืน โดยจ่าฝูงจะเป็นผู้นำฝูงในการออกหากิน",
      "imagePath": "assets/AsianElephant.jpg"
    },
    {
      "id": 7,
      "name": "Javan Rhino",
      "scientificName": "Rhinoceros sondaicus",
      "description": "ชื่อวิทยาศาสตร์ Rhinoceros sondaicus สัตว์กีบคี่ มีกีบข้างละสามกีบ หนักราว 1.5-2 ตัน สูงราว 160-175 เซนติเมตร ความยาวหัว-ลำตัว 300-320 เซนติเมตร หางยาว 70 เซนติเมตร ตามลำตัวมีสีเทาหม่น มีเอกลักษณ์ คือมีนอเหนือจมูก นอแรดส่วนใหญ่ยาวไม่ถึง 15 เซนติเมตร นอที่ยาวที่สุดที่เคยพบยาว 25 เซนติเมตร หนังหนามีรอยพับจนดูเป็นเหมือนชุดเกราะ",
      "location": "แตกต่างกันไปตามชนิดได้แก่ สะวันนา ท่งหญ้า พื้นทีชุ่มน้ำและป่าทึบในเขตร้อน แรดกินพืชเป็นอาหาร เช่น หญ้า หน่อไม้ ใบไม้ ผลไม้ ลูกไม้ใบอ่อน",
      "behavior": "สัตว์โดดเดี่ยว ทั้งตัวผู้และตัวเมียจะมีเขตแดนของตนเองแรดใช้นอเพือป้องกันเขตแดนหรือคู่ครองรวมทั้งป้องกันตัวจากศัตรู เช่น สิงโต เสือ หมาใน แรดจะแยกกันอยู่หลังจากผสมพันธุ์ โดยตัวเมียตั้งท้องราว 14-18 เดือน ออกลูกครั้งละ 1 ตัว ลูกแรดจะดูดนมแม่จนถึงอายุ 1 ขวบ และออกจากแม่ไปเมื่ออายุ 3 ปี ตัวเมียเว้นระยะตั้งท้อง 2-5 ปี แรดมีอายุเฉลี่ย 40-45 ปี",
      "imagePath": "assets/JavanRhino.jpg"
    },
    {
      "id": 8,
      "name": "Chital Deer",
      "scientificName": "Axis axis",
      "description": "ชื่อทางวิทยาศาสตร์ Axis axis กวางทีมีขนาดกลางมีขนสีน้ำตาลแดงมีจุดสีขาวเรียงเป็นลายข้างตัวให้ความสวยงามและสะดุดตากลางหลังมีแถบสีดำทอดเป็นแนวยาวไปถึงโคนหาง",
      "location": "อินเดีย ศรีลังกา บังกลาเทศ ภูฐาน ปากีสถาน",
      "behavior": "ชอบอยู่รวมกันเป็นฝูงใหญ่ หากินตามทุ่งหญ้าโล่งหรือป่าโปร่ง ออกหากินในช่วงตอนเย็นจนถึงเช้าตรู่ กระหายน้ำเก่ง ต้องกินน้ำบ่อยๆ ชอบสะอาดไม่ชอบนอนเกลือกปลักตมเหมือนกวางป่า ตัวผู้มีนิสัยรักสงบ ไม่ดุร้าย เหมือนกวางชนิดอื่น ตัวผู้หลายๆตัวสามารถอยู่ รวมฝูงกันได้อย่างสงบ",
      "imagePath": "assets/ChitalDeer.jpg"
    },
    {
      "id": 9,
      "name": "Lar Gibbon",
      "scientificName": "Hylobates lar",
      "description": "ชื่อวิทยาศาสตร์ Hylobates lar ชะนีมือขาวมีทั้งสีดำและสีขาว ส่วนหลังมือและหลังเท้าเป็นสีขาวและมีวงขาวรอบใบหน้า ใบหน้าและหูดำ มือยาว รูปร่างเพรียว ไม่มีหาง",
      "location": "พม่าแถบเทือกเขาตะนาวศรีไทยลาวและทางด้านตะวันออกของแม่น้ำสาละวิน ทางด้านตะวันตกของแม่น้ำโขงในลาว ทางด้านทิศตะวันตกเฉียงใต้ของยูนาน มาเลเซีย และทางด้านทิศเหนือของเกาะสุมาตรา",
      "behavior": "ชอบห้อยโหนไปตามกิ่งไม้ ใช้ชีวิตเกือบทั้งวันอยู่บนต้นไม้สูง เวลากินน้ำใช้หลังนิ้วแตะน้ำและยกดูด ชอบร้องและผึ่งแดดเวลาเช้าตรู่ เวลาอากาศร้อนจัดจะลงมาจากต้นไม้สูงเพือหลบแดด เวลาตกใจจะเหวี่ยงตัวโหนไปตามกิ่งไม้อย่างรวดเร็ว เหยี่ยวและงูเหลือมเป็นศัตรูสำคัญของชะนี",
      "imagePath": "assets/LarGibbon.jpg"
    },
    {
      "id": 10,
      "name": "Long-Crested Porcupine",
      "scientificName": "Hystrix cristata",
      "description": "ชื่อวิทยศาสตร์ Hystrix brachyura สัตว์ในอันดับสัตว์ฟันแทะกลุ่มเดียวกับหนู กระรอกเป็นสัตว์ฟันแทะที่มีขนาดร่างกายใหญ่ หนาและเตี้ย รูปร่างของหัวส่วนหน้าและจมูกค่อนข้างยาว ขนที่ส่วนใบหน้า ใต้คอและใต้ท้องเป็นขนอ่อนหยาบสีน้ำตาลขนด้านข้างลำคอ สันคอไปจนถึงตอนบนของหลังเป็นขนหยาบยาวสีดำเข้มเกือบดำ ขนหนามแข็งขนาดใหญ่ที่จะขึ้นห่างๆ กัน ยาวตั้งแต่ 5 - 30 เซนติเมตร เป็นขนยาวมีสีขาวและมีวงรอบขนสีดำอยู่กลางขน ภายในกลวงเมื่อเม่นแกว่งหางจะเกิดเสียงดัง",
      "location": "่ป่าทุกประเภท ตั้งแต่พืนที่ราบต่ำถึงบนเขาทีความสง 1,500 เมตรจากระดับน้ำทะเลอาศัยตามโพรงดิน ซอกหินตามป่า พบใน ไทย มาเลเซีย สิงคโปร์ สุมาตรา บอร์เนียว พบในป่าทุกชนิด",
      "behavior": "สามารถปรับตัวให้อาศัยในหลากหลายสภาพแวดล้อม หากินเวลากลางคืน ในเวลากลางวันจะหลบอยู่ในโพรงดิน เมื่อพบศัตรูจะแสดงอาการขู่ โดยกระทืบเท้า ตั้งขนขึ้นและสั่นหางทำให้เกิดเสียงดัง เม่นไม่สามารถสลัดขนไล่ศัตรูได้แต่ขนเม่นหลุดง่ายเมือศัตรูถูกขนเม่นตำขนจึงหลุดติดไปกับศัตรู",
      "imagePath": "assets/Long-CrestedPorcupine.jpg"
    },
    {
      "id": 11,
      "name": "Baboon",
      "scientificName": "Papio",
      "description": "ชื่อวิทยาศาตร์ Papio cynocephalus รูปร่างค่อนข้างใหญ่ ขนตามตัวสีน้ำตาล ขนค่อนข้างหยาบ หน้าดำ หูมีขนน้อย แต่ตัวผู้ขนตรงรอบคอและไหล่ยาว และมีขนปรกที่ปาก ร้องเสียงดัง วิ่งเหมือนม้าควบ ว่ายน้ำเก่ง",
      "location": "แอฟริกาใต้",
      "behavior": "ชอบอยู่รวมกันเป็นฝูง ฝูงหนึ่งมีจำนวนเป็นร้อยอาจถึง 200-300 ตัว มีหัวหน้าเป็นตัวผู้ ซึ่งเป็นผู้ควบคุมสังคมของมันให้เป็นระเบียบ ในเวลากลางคืนชอบนอนในถ้ำ ซอกหิน หรือ บนกิ่งไม้ใหญ่ ลิงบาบูนไม่ค่อยพบในป่าทึบ ชอบอยู่ตามเขาที่เป็นหินมีต้นไม้น้อย",
      "imagePath": "assets/Baboon.jpg"
    },
    {
      "id": 12,
      "name": "White Tiger",
      "scientificName": "Panthera tigris",
      "description": "ชื่อวิทยาศาสตร์ Panthera tigris สีขนเป็นสีขาวซึ่งเกิดจากความผิดปกติของเม็ดสีมักพบในเสือโคร่งเบงกอลที่ขนมักจะเป็นสีส้ม เสือโคร่งขาวจะมีการเติบโตเร็วกว่าและขนาดใหญ่กว่าเสือโคร่งเบงกอล เสือโคร่งขาวมีแนวโน้มที่ค่อนข้างใหญ่ตั้งแต่เกิดและจนถึงโตเต็มที่ เสือโคร่งขาวโตเต็มวัยเมื่อมีอายุ 2-3 ปี",
      "location": "ประเทศอินเดีย บังคลาเทศ และเนปาล บริเวณทุ่งหญ้าและป่ าฝน",
      "behavior": "กินเนื้อเป็นอาหาร มันสามารถว่ายน้ำได้ดีเพื่อไล่ล่าเหยื่อที่หนีลงน้ำ เสือโคร่งขาวสามารถล่าเหยื่อที่มีน้ำหนักเกือบถึงตันได้ รวมไปถึง ลิงขนาดเล็ก นก วัวป่า และกวาง",
      "imagePath": "assets/WhiteTiger.jpg"
    },
    {
      "id": 13,
      "name": "Lion",
      "scientificName": "Panthera leo",
      "description": "ชื่อวิทยาศาสตร์ Panthera leo สิงโตแอฟริกา และสิงโตอินเดียไม่มีลักษณะที่แตกต่างกัน สิงโตไม่มีลายบนตัวอย่างเสือ ตัวผู้ที่โตเต็มที่จะมีขนยาวขึ้นรอบคอ ดูสง่าน่าเกรงขาม ตัวเมียไม่มีขนรอบคอ ตรงปลายหางมีขนขึ้นเป็นพู่",
      "location": "ทวีปแอฟริกา ในทวีปเอเชียยังคงพบได้บ้างเช่นในประเทศอินเดียทางแถบตะวันตก",
      "behavior": "ชอบอยู่เป็นฝูงตามทุ่งโล่ง ขนาดของฝูงขึ้นอยู่กับปริมาณของเหยื่อเวลาส่วนใหญ่ของสิงโตหมดไปกับการนอนพักผ่อน จะล่าเหยื่อก็ต่อเมื่อหิว หน้าที่ล่าเหยื่อจะเป็นของตัวเมียเป็นส่วนใหญ่ ตัวผู้ล่าเหยื่อไม่เก่ง แต่จะเป็นผู้คอยกันตัวเมียออกจากซากเหยื่อ",
      "imagePath": "assets/Lion.jpg"
    },
    {
      "id": 14,
      "name": "Binturong",
      "scientificName": "Arctictis binturong",
      "description": "ชื่อวิทยาศาสตร์ Arctictis binturong มีขนาดใหญ่ที่สุดในวงศ์ชะมด หัวใหญ่ คอหนา ขนที่หน้าสีเทาและบางตัวต่อเนื่องไปถึงไหล่ หูกลมเล็กส่วนขอบสีขาว มีขนพู่หลังใบหูยาว ลำตัวยาว ดูใหญ่หนาและมีขนยาวหยาบสีดำ ส่วนปลายเป็นสีขาว ส่วนหางมีขนยาวและความยาวหางใกล้เคียงกับความยาวหัวและลำตัว",
      "location": "ประเทศบังคลาเทศ ตะวันออกเฉียงเหนือของอินเดีย มณฑลกวางสี ยูนานในประเทศจีน และกลุ่มประเทศเอเชียตะวันออกเฉียงใต้",
      "behavior": "สัตว์ที่อยู่ตัวเดียว เป็นสัตว์หากินในเวลากลางคืน ใช้เวลาส่วนใหญ่อยู่บนยอดไม้ การเคลื่อนที่จะเป็นแบบช้าๆว่ายน ้าในช่วงที่อากาศร้อน หมีขอจะสามารถเปล่งเสียงได้หลายเสียง",
      "imagePath": "assets/Binturong.jpg"
    }
  ];

  // ฟังก์ชันที่คืนค่าข้อมูลในรูปแบบ JSON
  String getAnimalsJson() {
    return jsonEncode(animals); // แปลงข้อมูลเป็น JSON string
  }
}

void main() async {
  final api = AnimalApi();
  final ip = InternetAddress.anyIPv4;
  final port = 8000;

  final server = await HttpServer.bind(ip, port);
  print('Server running at http://${ip.address}:$port');

  await for (HttpRequest request in server) {

    request.response.headers.contentType = ContentType.json;

    if (request.method == 'GET' && request.uri.path == '/') {
      request.response.write(api.getAnimalsJson());
    } else {
      request.response
        ..statusCode = HttpStatus.notFound
        ..write('404 Not Found');
    }

    await request.response.close();
  }
}
